---
kind: type
id: T:Autodesk.Revit.DB.SweptProfile
source: html/360ebf77-0040-ff11-733e-289f4e66bd21.htm
---
# Autodesk.Revit.DB.SweptProfile

Represents an extruded profile swept along a driving curve.

## Syntax (C#)
```csharp
public class SweptProfile : IDisposable
```

## Remarks
Elements such as beams may be formed from a profile that has been swept
 along a curve. This class represents such a form and is used to access the
 cross section and the underlying curve that make up the Element.